src/InformationRegisters/ОборудованиеОперативныеНастройки/ОборудованиеОперативныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеОперативныеНастройки</name>
  <attributes>
    <name>ДатаЗаписиUTC</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперативныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ЯзыкиСистемы/ЯзыкиСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЯзыкиСистемы</name>
  <enumValues>
    <name>Русский</name>
  </enumValues>
  <enumValues>
    <name>Английский</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/ОборудованиеОперативныеНастройки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПрочитатьНастройки(Оборудование) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   ДатаЗаписиUTC,
    |   ОперативныйРежим,
    |   ЯзыкОС
    |ИЗ
    |   РегистрСведений.ОборудованиеОперативныеНастройки
    |ГДЕ
    |   Оборудование = &Оборудование
    |";
    
    Запрос.УстановитьПараметр("Оборудование", Оборудование);
    
    Результат = Запрос.Выполнить();
    
    Настройки = Новый Структура("ДатаЗаписиUTC, ОперативныйРежим, ЯзыкОС", Дата(1,1,1), Ложь, Перечисления.ЯзыкиСистемы.Английский);
    Если НЕ Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        ЗаполнитьЗначенияСвойств(Настройки, Выборка);
    КонецЕсли;
        
    Возврат Настройки;
    
КонецФункции

Процедура ЗаписатьНастройки(Оборудование, Настройки) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Оборудование = Оборудование;
    
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Настройки);
    
    МенеджерЗаписи.Записать(Истина);
    
КонецПроцедуры

Процедура ОчиститьНастройки(Оборудование) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Оборудование = Оборудование;
    МенеджерЗаписи.Удалить();
    
КонецПроцедуры

#КонецОбласти
    
#КонецЕсли
